Documents/СличительнаяВедомость.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>СличительнаяВедомость</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьПоБУ</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаИнвентаризации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияИнвентаризации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОстатков</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МОЛ1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МОЛ2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверяющий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредседательКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУчетаРасходовБУ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияДоходовРасходовБУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУчетаДоходовБУ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияДоходовРасходовБУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаСчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обрабатывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЧленыКомиссии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЧленКомиссии</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Таблица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТМЦ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоБУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоИзлишек</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаИзлишек</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоНедостача</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНедостача</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СличительнаяВедомость/Ext/ObjectModule.bsl
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ДобавитьПрефиксУзла(Префикс);
	
КонецПроцедуры

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("Печать","Печать");
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Заголовок = ПредставлениеДокументаПриПроведении(Ссылка);
	
	СтруктураШапкиДокумента = СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	ДвиженияПоБУ(Режим, Отказ, Заголовок,СтруктураШапкиДокумента);
		
КонецПроцедуры

Функция ПечатьДокумента(ИмяМакета)
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("Отчет");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СличительнаяВедомостьТаблица.ТМЦ,
	|	СличительнаяВедомостьТаблица.ТМЦ.Код,
	|	СличительнаяВедомостьТаблица.ТМЦ.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СличительнаяВедомостьТаблица.КоличествоФакт КАК КоличествоФакт,
	|	СличительнаяВедомостьТаблица.СуммаФакт КАК СуммаФакт,
	|	СличительнаяВедомостьТаблица.КоличествоБУ КАК КоличествоБУ,
	|	СличительнаяВедомостьТаблица.СуммаБУ КАК СуммаБУ,
	|	СличительнаяВедомостьТаблица.КоличествоИзлишек КАК КоличествоИзлишек,
	|	СличительнаяВедомостьТаблица.СуммаИзлишек КАК СуммаИзлишек,
	|	СличительнаяВедомостьТаблица.КоличествоНедостача КАК КоличествоНедостача,
	|	СличительнаяВедомостьТаблица.СуммаНедостача КАК СуммаНедостача,
	|	СличительнаяВедомостьТаблица.Счет,
	|	СличительнаяВедомостьТаблица.НомерСтроки
	|ИЗ
	|	Документ.СличительнаяВедомость.Таблица КАК СличительнаяВедомостьТаблица
	|ГДЕ
	|	СличительнаяВедомостьТаблица.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	СличительнаяВедомостьТаблица.НомерСтроки
	|ИТОГИ
	|	СУММА(КоличествоФакт),
	|	СУММА(СуммаФакт),
	|	СУММА(КоличествоБУ),
	|	СУММА(СуммаБУ),
	|	СУММА(КоличествоИзлишек),
	|	СУММА(СуммаИзлишек),
	|	СУММА(КоличествоНедостача),
	|	СУММА(СуммаНедостача)
	|ПО
	|	ОБЩИЕ";
	
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	
	
	ТабДок.Очистить();
	
	
	Строка = Макет.ПолучитьОбласть("Строка");
	Титул = Макет.ПолучитьОбласть("Титул");
	Страница = Макет.ПолучитьОбласть("Страница");
	Шапка = Макет.ПолучитьОбласть("Шапка");
//	ИтСтрП = Макет.ПолучитьОбласть("ИтСтрП");
	ИтОписьЧ = Макет.ПолучитьОбласть("ИтОписьЧ");
	Итог1 = Макет.ПолучитьОбласть("Итог1");
	Итог2 = Макет.ПолучитьОбласть("Итог2");
	
	Титул.Параметры.Организация=Организация;
	Титул.Параметры.ОрганизацияИНН=Организация.ИНН;
	Титул.Параметры.Склад=Склад;
	Титул.Параметры.Основание=ОснованиеНомер+" от "+Формат(ОснованиеДата,"ДФ=dd.MM.yyyy");
	Титул.Параметры.ДатаОстатков=ДатаОстатков;
	Титул.Параметры.ДатаНачалаИнвентаризации=ДатаНачалаИнвентаризации;
	Титул.Параметры.ДатаОкончанияИнвентаризации=ДатаОкончанияИнвентаризации;
	Титул.Параметры.Номер=Номер;
	Титул.Параметры.МОЛ1=МОЛ1;
	Титул.Параметры.МОЛ2=МОЛ2;
	Титул.Параметры.МОЛ1Должность=ДолжностьСотрудника(МОЛ1,Дата);
	Титул.Параметры.МОЛ2Должность=ДолжностьСотрудника(МОЛ2,Дата);
	ТабДок.Вывести(Титул);     
	ТабДок.Вывести(Шапка);
	
	//ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	КолСтрокНаЛисте = 20;
	ТекСтрока = 0;
	
	ВыборкаОбщие = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаОбщие.Следующий();
	
	МПЗ = ВыборкаОбщие.Выбрать();
	Пропущено=0;
	
	Пока МПЗ.Следующий() Цикл
		
		Если ТекСтрока = КолСтрокНаЛисте Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			ТекСтрока = 0;
			ТабДок.Вывести(Шапка);
			КолСтрокНаЛисте = 42;
		КонецЕсли;
		
		ТекСтрока=ТекСтрока+ 1;
		Строка.Параметры.Заполнить(МПЗ);
		ТабДок.Вывести(Строка);
		
		//Если ТекСтрока = КолСтрокНаЛисте Тогда
		//	ИтСтрЧ.Параметры.ИтогКоличСтраница=ИтогКоличСтраница;
		//	ИтСтрЧ.Параметры.ИтогСуммаСтраница=ИтогСуммаСтраница;
		//	ТабДок.Вывести(ИтСтрЧ);
		//	Если Ном<>(МПЗ.Количество()-Пропущено) Тогда
		//		ТабДок.Вывести(ПодписиНаСтраницах);
		//	КонецЕсли;
		//	Если Ном < МПЗ.Количество() Тогда
		//		//ИтСтрП.Параметры.КолНомСтр=СтрЗаменить(ЧислоПрописью(КолНомСтр),"00","");
		//		//ТабДок.Вывести(ИтСтрП);
		//	КонецЕсли;
		//КонецЕсли;
	КонецЦикла;
	//Если ТекСтрока < КолСтрокНаЛисте Тогда
	//	ИтСтрЧ.Параметры.ИтогКоличСтраница=ИтогКоличСтраница;
	//	ИтСтрЧ.Параметры.ИтогСуммаСтраница=ИтогСуммаСтраница;
	//	ТабДок.Вывести(ИтСтрЧ);
	//КонецЕсли;
	//
	//ИтОписьЧ.Параметры.ИтогКоличОпись=ИтогКоличОпись;
	//ИтОписьЧ.Параметры.ИтогСуммаОпись=ИтогСуммаОпись;
	
	ИтОписьЧ.Параметры.Заполнить(ВыборкаОбщие);
	ТабДок.Вывести(ИтОписьЧ);
	//ТабДок.Вывести(ПодписиНаСтраницах);
	
	//ИтСтрП.Параметры.КолНомСтр=СтрЗаменить(ЧислоПрописью(КолНомСтр),"00","");
	//ТабДок.Вывести(ИтСтрП);
	
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	
	Итог1.Параметры.Председатель=ПредседательКомиссии;
	Итог1.Параметры.ПредседательДолжность=ДолжностьСотрудника(ПредседательКомиссии,Дата);
	
	ТабДок.Вывести(Итог1);
	
	Для каждого Строка Из ЧленыКомиссии Цикл
		Если Строка.НомерСтроки=1 Тогда
			ОбластьЧленКомиссии = Макет.ПолучитьОбласть("ЧленКомиссии1");
		Иначе	
			ОбластьЧленКомиссии = Макет.ПолучитьОбласть("ЧленКомиссии");
		КонецЕсли; 
		ОбластьЧленКомиссии.Параметры.ЧленКомиссии = Строка.ЧленКомиссии;
		ОбластьЧленКомиссии.Параметры.ЧленКомиссииДолжность = ДолжностьСотрудника(Строка.ЧленКомиссии,Дата);
		ТабДок.Вывести(ОбластьЧленКомиссии);
	КонецЦикла;  
	
	Итог2.Параметры.Проверяющий=Проверяющий;
	Итог2.Параметры.ПроверяющийДолжность=ДолжностьСотрудника(Проверяющий,Дата);
	
	ТабДок.Вывести(Итог2);
	
	ТабДок.Автомасштаб=истина;
	ТабДок.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
	
	Возврат ТабДок;
	
КонецФункции

Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать
	
	ТабДокумент = ПечатьДокумента(ИмяМакета);
		
	НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, "");
	
КонецПроцедуры // Печать()

Процедура ПроверитьЗаполнениеДокумента(Отказ, Заголовок, СтруктураШапкиДокумента)
	
	////Проверяем заполнение шапки
	//СтруктураОбязательныхПолей = Новый Структура("Организация");
	//СтруктураОбязательныхПолей.Вставить("Склад","Не выбран склад.");
	//
	//ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	//
	////Проверяем заполнение табличной части 
	//
	//СтруктураОбязательныхПолей = Новый Структура();
	//СтруктураОбязательныхПолей.Вставить("Номенклатура","Не выбрана номенклатура");
	//ПроверитьЗаполнениеТабличнойЧастиПлатежногоДокумента(ЭтотОбъект, "Номенклатура", СтруктураПолей, Отказ, Заголовок);
	
КонецПроцедуры

Процедура ДвиженияПоБУ(Режим, Отказ, Заголовок,СтруктураШапкиДокумента);
	
	ПроводкиБУ = Движения.Хозрасчетный;
	
	Для Каждого Строка Из Таблица Цикл
		
		Если Строка.КоличествоНедостача<>0 или Строка.СуммаНедостача<>0 Тогда
			
			Проводка = ПроводкиБУ.Добавить();
			Проводка.Период      = Дата;
			Проводка.Организация = Организация;
			Проводка.Содержание = "";
			
			Проводка.СчетДт = СтруктураШапкиДокумента.СпособУчетаРасходовБУ.Счет;
			УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтруктураШапкиДокумента.СпособУчетаРасходовБУ.Субконто1);
			УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтруктураШапкиДокумента.СпособУчетаРасходовБУ.Субконто2);
			УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтруктураШапкиДокумента.СпособУчетаРасходовБУ.Субконто3);
			
			Проводка.СчетКт = Строка.Счет;
			УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, Строка.ТМЦ);
			УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, Склад);
			
			Проводка.КоличествоКт = Строка.КоличествоНедостача;
			Проводка.Сумма = Строка.СуммаНедостача;
			
		КонецЕсли;
		
		Если Строка.КоличествоИзлишек<>0 или Строка.СуммаИзлишек<>0 Тогда
			
			Проводка = ПроводкиБУ.Добавить();
			Проводка.Период      = Дата;
			Проводка.Организация = Организация;
			Проводка.Содержание = "";
			
			Проводка.СчетДт = Строка.Счет;
			УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Строка.ТМЦ);
			УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, Склад);
			
			Проводка.СчетКт = СтруктураШапкиДокумента.СпособУчетаДоходовБУ.Счет;
			УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтруктураШапкиДокумента.СпособУчетаДоходовБУ.Субконто1);
			УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтруктураШапкиДокумента.СпособУчетаДоходовБУ.Субконто2);
			УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтруктураШапкиДокумента.СпособУчетаДоходовБУ.Субконто3);
			
			Проводка.КоличествоДт = Строка.КоличествоИзлишек;
			Проводка.Сумма = Строка.СуммаИзлишек;
			
		КонецЕсли;
		
	КонецЦикла;				
					
КонецПроцедуры
